Repository: shotpaste/shotpaste
Catalog: resources/localization/Features/Agent.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, ru, vi, zh_hans, zh_hant

source: agent.approval.unverified-target-title
de: Unverifizierten Koordinatenklick bestätigen
es: Confirmar clic en coordenadas no verificadas
fr: Confirmer le clic sur des coordonnées non vérifiées
ja: 未確認の座標クリックを承認
ko: 확인되지 않은 좌표 클릭 승인
ru: Подтвердить непроверенный щелчок по координатам
vi: Xác nhận nhấp vào tọa độ chưa xác minh
zh_hans: 确认未验证的坐标点击
zh_hant: 確認未經驗證的座標點擊

source: agent.approval.unverified-target-detail
de: Der Agent-Modus möchte auf Koordinaten klicken, die keinem beobachteten Bedienungshilfen-Element zugeordnet werden konnten. Das Ziel kann lokal nicht überprüft werden.
es: El modo Agente quiere hacer clic en coordenadas que no se pudieron asociar con un elemento de Accesibilidad observado. El destino no se puede verificar localmente.
fr: Le mode Agent souhaite cliquer sur des coordonnées qui n’ont pu être associées à aucun élément d’accessibilité observé. La cible ne peut pas être vérifiée localement.
ja: Agent モードが、観察済みのアクセシビリティ要素と一致しない座標をクリックしようとしています。この対象はローカルで検証できません。
ko: Agent 모드가 관찰된 손쉬운 사용 요소와 일치하지 않는 좌표를 클릭하려고 합니다. 대상을 로컬에서 확인할 수 없습니다.
ru: Режим агента хочет выполнить щелчок по координатам, которые не удалось сопоставить с наблюдаемым элементом универсального доступа. Цель нельзя проверить локально.
vi: Chế độ Agent muốn nhấp vào tọa độ không khớp với phần tử Trợ năng đã quan sát. Không thể xác minh mục tiêu cục bộ.
zh_hans: Agent 模式想点击无法与已观察辅助功能元素匹配的坐标。无法在本地验证该目标。
zh_hant: Agent 模式想點擊無法與已觀察輔助使用元素相符的座標。無法在本機驗證該目標。

# agent.connection-test-authentication-failed
source: Authentication failed. Check the API key.
de: Authentifizierung fehlgeschlagen. Prüfe den API-Schlüssel.
es: La autenticación falló. Comprueba la clave API.
fr: Échec de l’authentification. Vérifiez la clé API.
ja: 認証に失敗しました。API キーを確認してください。
ko: 인증에 실패했습니다. API 키를 확인하세요.
ru: Ошибка аутентификации. Проверьте API-ключ.
vi: Xác thực thất bại. Kiểm tra khóa API.
zh_hans: 认证失败，请检查 API Key。
zh_hant: 驗證失敗，請檢查 API Key。

# agent.connection-test-hint
source: The test sends only fixed short text, never screenshots, recordings, or transcripts. The provider may charge for it.
de: Der Test sendet nur einen festen kurzen Text, keine Screenshots, Aufnahmen oder Transkripte. Der Anbieter kann dafür Gebühren berechnen.
es: La prueba solo envía un texto breve fijo, nunca capturas, grabaciones ni transcripciones. El proveedor puede cobrar por ella.
fr: Le test envoie uniquement un court texte prédéfini, jamais de captures d’écran, d’enregistrements ou de transcriptions. Le fournisseur peut le facturer.
ja: テストでは固定の短いテキストだけを送信し、スクリーンショット、録音、文字起こしは送信しません。プロバイダーが料金を請求する場合があります。
ko: 테스트는 고정된 짧은 텍스트만 전송하며 스크린샷, 녹음 또는 전사문은 전송하지 않습니다. 공급자가 요금을 청구할 수 있습니다.
ru: Проверка отправляет только короткий фиксированный текст, без снимков экрана, записей или расшифровок. Поставщик может взимать плату.
vi: Kiểm tra chỉ gửi văn bản ngắn cố định, không gửi ảnh chụp màn hình, bản ghi âm hoặc bản chép lời. Nhà cung cấp có thể tính phí.
zh_hans: 测试只发送固定短文本，不会发送截图、录音或文字稿；供应商可能计费。
zh_hant: 測試只傳送固定短文字，不會傳送截圖、錄音或文字稿；供應商可能收費。

# agent.connection-test-invalid-configuration
source: Check the API endpoint and model settings.
de: Prüfe den API-Endpunkt und die Modelleinstellungen.
es: Comprueba el endpoint de API y la configuración del modelo.
fr: Vérifiez le point de terminaison API et les paramètres du modèle.
ja: API エンドポイントとモデルの設定を確認してください。
ko: API 엔드포인트와 모델 설정을 확인하세요.
ru: Проверьте конечную точку API и настройки модели.
vi: Kiểm tra điểm cuối API và cấu hình mô hình.
zh_hans: 请检查 API 端点和模型配置。
zh_hant: 請檢查 API 端點與模型設定。

# agent.connection-test-invalid-response
source: The provider returned no valid text. Check the protocol and model.
de: Der Anbieter hat keinen gültigen Text zurückgegeben. Prüfe das Protokoll und das Modell.
es: El proveedor no devolvió texto válido. Comprueba el protocolo y el modelo.
fr: Le fournisseur n’a renvoyé aucun texte valide. Vérifiez le protocole et le modèle.
ja: プロバイダーが有効なテキストを返しませんでした。プロトコルとモデルを確認してください。
ko: 공급자가 유효한 텍스트를 반환하지 않았습니다. 프로토콜과 모델을 확인하세요.
ru: Поставщик не вернул допустимый текст. Проверьте протокол и модель.
vi: Nhà cung cấp không trả về văn bản hợp lệ. Kiểm tra giao thức và mô hình.
zh_hans: 供应商未返回有效文本，请检查协议和模型。
zh_hant: 供應商未傳回有效文字，請檢查通訊協定與模型。

# agent.connection-test-missing-key
source: Save an LLM API key first.
de: Speichere zuerst einen LLM-API-Schlüssel.
es: Guarda primero una clave API de LLM.
fr: Enregistrez d’abord une clé API LLM.
ja: 先に LLM API キーを保存してください。
ko: 먼저 LLM API 키를 저장하세요.
ru: Сначала сохраните API-ключ LLM.
vi: Trước tiên hãy lưu khóa API LLM.
zh_hans: 请先保存 LLM API Key。
zh_hant: 請先儲存 LLM API Key。

# agent.connection-test-network-failed
source: Could not connect to the provider. Check the network and API endpoint.
de: Keine Verbindung zum Anbieter. Prüfe das Netzwerk und den API-Endpunkt.
es: No se pudo conectar con el proveedor. Comprueba la red y el endpoint de API.
fr: Impossible de se connecter au fournisseur. Vérifiez le réseau et le point de terminaison API.
ja: プロバイダーに接続できません。ネットワークと API エンドポイントを確認してください。
ko: 공급자에 연결할 수 없습니다. 네트워크와 API 엔드포인트를 확인하세요.
ru: Не удалось подключиться к поставщику. Проверьте сеть и конечную точку API.
vi: Không thể kết nối đến nhà cung cấp. Kiểm tra mạng và điểm cuối API.
zh_hans: 无法连接供应商，请检查网络和 API 端点。
zh_hant: 無法連線至供應商，請檢查網路與 API 端點。

# agent.connection-test-provider-failed
source: The provider could not complete the request. Try again later.
de: Der Anbieter konnte die Anfrage nicht abschließen. Versuche es später erneut.
es: El proveedor no pudo completar la solicitud. Inténtalo de nuevo más tarde.
fr: Le fournisseur n’a pas pu traiter la requête. Réessayez plus tard.
ja: プロバイダーがリクエストを完了できませんでした。後でもう一度お試しください。
ko: 공급자가 요청을 완료하지 못했습니다. 나중에 다시 시도하세요.
ru: Поставщик не смог выполнить запрос. Повторите попытку позже.
vi: Nhà cung cấp không thể hoàn tất yêu cầu. Hãy thử lại sau.
zh_hans: 供应商暂时无法完成请求，请稍后重试。
zh_hant: 供應商暫時無法完成請求，請稍後重試。

# agent.connection-test-rate-limited
source: The request was rate limited. Try again later.
de: Das Anfragelimit wurde erreicht. Versuche es später erneut.
es: Se alcanzó el límite de solicitudes. Inténtalo de nuevo más tarde.
fr: La limite de requêtes a été atteinte. Réessayez plus tard.
ja: リクエストがレート制限されました。後でもう一度お試しください。
ko: 요청이 속도 제한에 걸렸습니다. 나중에 다시 시도하세요.
ru: Превышен лимит запросов. Повторите попытку позже.
vi: Yêu cầu bị giới hạn tốc độ. Hãy thử lại sau.
zh_hans: 请求受到限流，请稍后重试。
zh_hant: 請求受到速率限制，請稍後重試。

# agent.connection-test-success
source: Connected. The model returned text.
de: Verbunden. Das Modell hat Text zurückgegeben.
es: Conexión correcta. El modelo devolvió texto.
fr: Connexion réussie. Le modèle a renvoyé du texte.
ja: 接続に成功しました。モデルがテキストを返しました。
ko: 연결되었습니다. 모델이 텍스트를 반환했습니다.
ru: Подключение установлено. Модель вернула текст.
vi: Kết nối thành công. Mô hình đã trả về văn bản.
zh_hans: 连接成功，模型已返回文本。
zh_hant: 連線成功，模型已傳回文字。

# agent.connection-test-timeout
source: The connection test timed out. Try again later.
de: Zeitüberschreitung beim Verbindungstest. Versuche es später erneut.
es: La prueba de conexión agotó el tiempo de espera. Inténtalo de nuevo más tarde.
fr: Le test de connexion a expiré. Réessayez plus tard.
ja: 接続テストがタイムアウトしました。後でもう一度お試しください。
ko: 연결 테스트 시간이 초과되었습니다. 나중에 다시 시도하세요.
ru: Время проверки подключения истекло. Повторите попытку позже.
vi: Kiểm tra kết nối đã hết thời gian chờ. Hãy thử lại sau.
zh_hans: 连接测试超时，请稍后重试。
zh_hant: 連線測試逾時，請稍後重試。

# agent.missing-api-key
source: Add an LLM API key in AI Features first
de: Zuerst einen LLM-API-Schlüssel unter KI-Funktionen hinzufügen
es: Añade primero una clave API de LLM en Funciones de IA
fr: Ajoutez d’abord une clé API LLM dans Fonctions IA
ja: 先に「AI機能」でLLM APIキーを追加してください
ko: 먼저 AI 기능에서 LLM API 키를 추가하세요
ru: Сначала добавьте API-ключ LLM в разделе Функции ИИ
vi: Trước tiên hãy thêm khóa API LLM trong Tính năng AI
zh_hans: 请先在“AI 功能”中添加 LLM API Key
zh_hant: 請先在「AI 功能」中加入 LLM API Key

source: agent.protocol-anthropic-messages
de: Anthropic Messages
es: Anthropic Messages
fr: Anthropic Messages
ja: Anthropic Messages
ko: Anthropic Messages
ru: Anthropic Messages
vi: Anthropic Messages
zh_hans: Anthropic Messages
zh_hant: Anthropic Messages

source: agent.protocol-openai-compatible
de: OpenAI Completions
es: OpenAI Completions
fr: OpenAI Completions
ja: OpenAI Completions
ko: OpenAI Completions
ru: OpenAI Completions
vi: OpenAI Completions
zh_hans: OpenAI Completions
zh_hant: OpenAI Completions

source: agent.protocol-title
de: API-Protokoll
es: Protocolo de API
fr: Protocole API
ja: API プロトコル
ko: API 프로토콜
ru: Протокол API
vi: Giao thức API
zh_hans: API 协议
zh_hant: API 協議

# agent.send-images-description
source: Controls screenshots sent by Agent Mode only; it does not control text translation.
de: Steuert nur die von Agent Mode gesendeten Screenshots; die Textübersetzung bleibt davon unberührt.
es: Solo controla las capturas que envía Agent Mode; no controla la traducción de texto.
fr: Contrôle uniquement les captures envoyées par Agent Mode ; ne contrôle pas la traduction de texte.
ja: Agent Mode が送信するスクリーンショットだけを制御します。テキスト翻訳には影響しません。
ko: Agent Mode가 보내는 스크린샷만 제어하며 텍스트 번역에는 영향을 주지 않습니다.
ru: Управляет только снимками, отправляемыми Agent Mode; не влияет на перевод текста.
vi: Chỉ kiểm soát ảnh Agent Mode gửi; không ảnh hưởng đến dịch văn bản.
zh_hans: 仅控制 Agent Mode 发送的截图；不控制文本翻译。
zh_hant: 僅控制 Agent Mode 傳送的截圖；不控制文字翻譯。

# agent.send-images-title
source: Send Agent Mode screenshots
de: Agent-Mode-Screenshots senden
es: Enviar capturas de Agent Mode
fr: Envoyer les captures d’écran d’Agent Mode
ja: Agent Mode のスクリーンショットを送信
ko: Agent Mode 스크린샷 보내기
ru: Отправлять снимки экрана Agent Mode
vi: Gửi ảnh chụp màn hình của Agent Mode
zh_hans: 发送 Agent Mode 截图
zh_hant: 傳送 Agent Mode 截圖

# agent.tab-title
source: AI Features
de: KI-Funktionen
es: Funciones de IA
fr: Fonctions IA
ja: AI機能
ko: AI 기능
ru: Функции ИИ
vi: Tính năng AI
zh_hans: AI 功能
zh_hant: AI 功能

# agent.test-connection
source: Test connection
de: Verbindung testen
es: Probar conexión
fr: Tester la connexion
ja: 接続をテスト
ko: 연결 테스트
ru: Проверить подключение
vi: Kiểm tra kết nối
zh_hans: 测试连接
zh_hant: 測試連線

# agent.testing-connection
source: Testing connection…
de: Verbindung wird getestet…
es: Probando conexión…
fr: Test de connexion…
ja: 接続をテスト中…
ko: 연결 테스트 중…
ru: Проверка подключения…
vi: Đang kiểm tra kết nối…
zh_hans: 正在测试连接…
zh_hant: 正在測試連線…

source: agent.thinking-title
de: Denkmodus
es: Modo de razonamiento
fr: Mode de réflexion
ja: 思考モード
ko: 사고 모드
ru: Режим размышления
vi: Chế độ suy luận
zh_hans: 思考模式
zh_hant: 思考模式

# agent.translation-section
source: AI Translation
de: KI-Übersetzung
es: Traducción con IA
fr: Traduction IA
ja: AI翻訳
ko: AI 번역
ru: ИИ-перевод
vi: Dịch AI
zh_hans: AI 翻译
zh_hant: AI 翻譯

# agent.translation-prompt-mode-title
source: Translation prompt
de: Übersetzungsprompt
es: Prompt de traducción
fr: Prompt de traduction
ja: 翻訳プロンプト
ko: 번역 프롬프트
ru: Промпт перевода
vi: Lời nhắc dịch
zh_hans: 翻译提示词
zh_hant: 翻譯提示詞

# agent.translation-prompt-mode-description
source: The safety and response-format rules are always enforced.
de: Sicherheits- und Antwortformatregeln werden immer erzwungen.
es: Las reglas de seguridad y formato de respuesta siempre se aplican.
fr: Les règles de sécurité et de format de réponse sont toujours appliquées.
ja: 安全および応答形式のルールは常に適用されます。
ko: 안전 및 응답 형식 규칙은 항상 적용됩니다.
ru: Правила безопасности и формата ответа применяются всегда.
vi: Các quy tắc an toàn và định dạng phản hồi luôn được áp dụng.
zh_hans: 安全和响应格式规则始终强制执行。
zh_hant: 安全與回應格式規則一律強制執行。

# agent.translation-prompt-builtin
source: Built-in
de: Integriert
es: Integrado
fr: Intégré
ja: 内蔵
ko: 내장
ru: Встроенный
vi: Tích hợp sẵn
zh_hans: 使用内置提示词
zh_hant: 使用內建提示詞

# agent.translation-prompt-custom
source: Custom
de: Benutzerdefiniert
es: Personalizado
fr: Personnalisé
ja: カスタム
ko: 사용자 설정
ru: Пользовательский
vi: Tùy chỉnh
zh_hans: 自定义
zh_hant: 自訂

# agent.translation-prompt-title
source: Translation preference
de: Übersetzungseinstellung
es: Preferencia de traducción
fr: Préférence de traduction
ja: 翻訳設定
ko: 번역 기본 설정
ru: Параметры перевода
vi: Tùy chọn dịch
zh_hans: 翻译偏好
zh_hant: 翻譯偏好

# agent.translation-prompt-variables
source: Supported placeholders: {{source_language}}, {{target_language}}
de: Unterstützte Platzhalter: {{source_language}}, {{target_language}}
es: Marcadores compatibles: {{source_language}}, {{target_language}}
fr: Variables prises en charge : {{source_language}}, {{target_language}}
ja: 使用できるプレースホルダー: {{source_language}}, {{target_language}}
ko: 지원되는 자리표시자: {{source_language}}, {{target_language}}
ru: Поддерживаемые подстановки: {{source_language}}, {{target_language}}
vi: Biến giữ chỗ được hỗ trợ: {{source_language}}, {{target_language}}
zh_hans: 支持占位符：{{source_language}}、{{target_language}}
zh_hant: 支援的預留位置：{{source_language}}、{{target_language}}

# agent.translation-restore-builtin
source: Restore built-in prompt
de: Integrierten Prompt wiederherstellen
es: Restaurar prompt integrado
fr: Restaurer le prompt intégré
ja: 内蔵プロンプトを復元
ko: 내장 프롬프트 복원
ru: Восстановить встроенный промпт
vi: Khôi phục lời nhắc tích hợp
zh_hans: 恢复内置提示词
zh_hant: 還原內建提示詞

# agent.translation-timeout-title
source: Translation timeout
de: Übersetzungszeitlimit
es: Tiempo de espera de traducción
fr: Délai de traduction
ja: 翻訳タイムアウト
ko: 번역 시간 제한
ru: Тайм-аут перевода
vi: Thời gian chờ dịch
zh_hans: 翻译超时
zh_hant: 翻譯逾時

# agent.translation-timeout-description
source: %lld seconds covering frozen crop, local OCR, paragraph and language analysis, network, retry, response parsing, and layout
de: %lld Sekunden für eingefrorenen Zuschnitt, lokale OCR, Absatz- und Sprachanalyse, Netzwerk, Wiederholung, Antwortanalyse und Layout
es: %lld segundos para recorte congelado, OCR local, análisis de párrafos e idioma, red, reintento, análisis de respuesta y diseño
fr: %lld secondes pour le recadrage figé, l’OCR local, l’analyse des paragraphes et de la langue, le réseau, la nouvelle tentative, l’analyse de la réponse et la mise en page
ja: 固定画像の切り出し、ローカル OCR、段落と言語の解析、ネットワーク、再試行、応答解析、レイアウトを含む %lld 秒
ko: 고정 영역 자르기, 로컬 OCR, 문단 및 언어 분석, 네트워크, 재시도, 응답 분석과 레이아웃에 %lld초
ru: %lld с на обрезку замороженного кадра, локальное OCR, анализ абзацев и языка, сеть, повтор, разбор ответа и компоновку
vi: %lld giây cho việc cắt ảnh đóng băng, OCR cục bộ, phân tích đoạn văn và ngôn ngữ, mạng, thử lại, phân tích phản hồi và dàn trang
zh_hans: %lld 秒，覆盖冻结画面裁剪、本地 OCR、段落与语言分析、网络、重试、响应解析和排版
zh_hant: %lld 秒，涵蓋凍結畫面裁切、本機 OCR、段落與語言分析、網路、重試、回應解析與排版

# agent.translation-provider-mode-title
source: Configured Provider (text mode)
de: Konfigurierter Provider (Textmodus)
es: Proveedor configurado (modo texto)
fr: Provider configuré (mode texte)
ja: 設定済み Provider（テキストモード）
ko: 구성된 Provider(텍스트 모드)
ru: Настроенный Provider (текстовый режим)
vi: Provider đã cấu hình (chế độ văn bản)
zh_hans: 已配置 Provider（文本模式）
zh_hant: 已設定 Provider（文字模式）

# agent.translation-provider-mode-description
source: Reuses the Agent protocol, endpoint, model, and credentials. Screen images are never uploaded.
de: Verwendet Protokoll, Endpunkt, Modell und Anmeldedaten des Agent. Bildschirmbilder werden niemals hochgeladen.
es: Reutiliza el protocolo, el endpoint, el modelo y las credenciales del Agent. Las imágenes de pantalla nunca se suben.
fr: Réutilise le protocole, le point de terminaison, le modèle et les identifiants de l’Agent. Les images d’écran ne sont jamais téléversées.
ja: Agent のプロトコル、エンドポイント、モデル、資格情報を再利用します。画面画像はアップロードされません。
ko: Agent의 프로토콜, 엔드포인트, 모델 및 자격 증명을 재사용합니다. 화면 이미지는 업로드되지 않습니다.
ru: Повторно используются протокол, конечная точка, модель и учётные данные Agent. Изображения экрана не загружаются.
vi: Tái sử dụng giao thức, điểm cuối, mô hình và thông tin xác thực của Agent. Ảnh màn hình không bao giờ được tải lên.
zh_hans: 继续复用 Agent 的协议、端点、模型和凭据。屏幕图片不会上传。
zh_hant: 繼續重用 Agent 的通訊協定、端點、模型與認證。螢幕影像不會上傳。

# agent.translation-send-recognized-text-title
source: Allow sending recognized text to Provider
de: Erkannten Text an Provider senden erlauben
es: Permitir enviar texto reconocido al proveedor
fr: Autoriser l’envoi du texte reconnu au Provider
ja: 認識したテキストの Provider への送信を許可
ko: 인식된 텍스트를 Provider로 보내기 허용
ru: Разрешить отправку распознанного текста Provider
vi: Cho phép gửi văn bản đã nhận dạng đến Provider
zh_hans: 允许发送识别出的文字到 Provider
zh_hant: 允許將辨識出的文字傳送至 Provider

# agent.translation-send-recognized-text-description
source: Screen images are never uploaded. ShotPaste recognizes text locally and sends only recognized text to the configured API.
de: Bildschirmbilder werden niemals hochgeladen. ShotPaste erkennt Text lokal und sendet nur den erkannten Text an die konfigurierte API.
es: Las imágenes de pantalla nunca se suben. ShotPaste reconoce el texto localmente y solo envía el texto reconocido a la API configurada.
fr: Les images d’écran ne sont jamais téléversées. ShotPaste reconnaît le texte localement et n’envoie que le texte reconnu à l’API configurée.
ja: 画面画像はアップロードされません。ShotPaste はローカルでテキストを認識し、認識したテキストだけを設定済み API に送信します。
ko: 화면 이미지는 업로드되지 않습니다. ShotPaste는 로컬에서 텍스트를 인식하고 인식된 텍스트만 구성된 API로 보냅니다.
ru: Изображения экрана не загружаются. ShotPaste распознаёт текст локально и отправляет в настроенный API только распознанный текст.
vi: Ảnh màn hình không bao giờ được tải lên. ShotPaste nhận dạng văn bản cục bộ và chỉ gửi văn bản đã nhận dạng đến API đã cấu hình.
zh_hans: 屏幕图片不会上传。ShotPaste 会在本地识别文字，并仅将识别出的文字发送到已配置的 API。
zh_hant: 螢幕影像不會上傳。ShotPaste 會在本機辨識文字，並僅將辨識出的文字傳送至已設定的 API。

# agent.translation-send-recognized-text-disabled
source: Recognized-text sharing is disabled; enable it before translating.
de: Die Weitergabe erkannten Textes ist deaktiviert; aktiviere sie vor dem Übersetzen.
es: El envío de texto reconocido está desactivado; actívalo antes de traducir.
fr: Le partage du texte reconnu est désactivé ; activez-le avant de traduire.
ja: 認識したテキストの共有が無効です。翻訳する前に有効にしてください。
ko: 인식된 텍스트 공유가 비활성화되어 있습니다. 번역하기 전에 활성화하세요.
ru: Отправка распознанного текста отключена; включите её перед переводом.
vi: Chia sẻ văn bản đã nhận dạng đang tắt; hãy bật trước khi dịch.
zh_hans: 识别文字发送已关闭；请在翻译前开启。
zh_hant: 辨識文字傳送已關閉；請在翻譯前開啟。

# agent.translation-provider-ready
source: Provider is ready
de: Provider ist bereit
es: El proveedor está listo
fr: Le Provider est prêt
ja: Provider の準備完了
ko: Provider 준비 완료
ru: Provider готов
vi: Provider sẵn sàng
zh_hans: Provider 配置已就绪
zh_hant: Provider 已準備就緒

# agent.translation-provider-unavailable
source: Provider configuration needs attention
de: Provider-Konfiguration erfordert Aufmerksamkeit
es: La configuración del proveedor requiere atención
fr: La configuration du Provider nécessite votre attention
ja: Provider 設定を確認してください
ko: Provider 구성을 확인하세요
ru: Требуется проверить конфигурацию Provider
vi: Cần kiểm tra cấu hình Provider
zh_hans: Provider 配置需要处理
zh_hant: Provider 設定需要處理

# agent.translation-ocr-coverage-description
source: Source-language coverage is limited by the languages supported by macOS Vision OCR on this Mac.
de: Die Quellsprachenabdeckung ist durch die von macOS Vision OCR auf diesem Mac unterstützten Sprachen begrenzt.
es: La cobertura de idiomas de origen está limitada por los idiomas compatibles con Vision OCR de macOS en este Mac.
fr: La couverture des langues source est limitée par les langues prises en charge par Vision OCR de macOS sur ce Mac.
ja: 原言語の対応範囲は、この Mac の macOS Vision OCR がサポートする言語に限られます。
ko: 원본 언어 지원 범위는 이 Mac의 macOS Vision OCR이 지원하는 언어로 제한됩니다.
ru: Набор исходных языков ограничен языками, которые поддерживает macOS Vision OCR на этом Mac.
vi: Phạm vi ngôn ngữ nguồn bị giới hạn bởi các ngôn ngữ mà Vision OCR của macOS hỗ trợ trên máy Mac này.
zh_hans: 源语言覆盖范围受本机 macOS Vision OCR 支持的语言限制。
zh_hant: 來源語言涵蓋範圍受本機 macOS Vision OCR 支援的語言限制。

source: agent.beta-badge
zh_hans: 测试版

source: agent.allow-application-session
zh_hans: 本次会话允许此应用

source: agent.answer-placeholder
zh_hans: 输入你的回答

source: agent.activity.audit-note
zh_hans: 展示可审计动作，不展示模型私有思维过程

source: agent.activity.event.action-failed
zh_hans: 动作失败

source: agent.activity.event.action-succeeded
zh_hans: 动作已完成

source: agent.activity.event.user-answered
zh_hans: 已收到回答

source: agent.activity.input-pause-hint
zh_hans: 使用鼠标或键盘会暂停 Agent

source: agent.activity.no-events
zh_hans: 正在准备首次观察…

source: agent.activity.observation-detail
zh_hans: %1$lld 个可访问元素 · %2$lld 行 OCR

source: agent.activity.waiting-task
zh_hans: 等待任务…

source: agent.api-key-description
zh_hans: 直接存储在应用偏好设置中；界面仅显示脱敏值

source: agent.api-key-title
zh_hans: LLM API Key

source: agent.approve-once
zh_hans: 仅允许一次

source: agent.busy-message
zh_hans: 另一个捕获、录屏或 Agent 会话正在进行

source: agent.click-anywhere-prompt
zh_hans: 点击希望 Agent 关注的位置

source: agent.continue-action
zh_hans: 继续

source: agent.deny-action
zh_hans: 拒绝

source: agent.endpoint-example
zh_hans: 域名示例：%@

source: agent.endpoint-title
zh_hans: API 端点

source: agent.intent-prompt-hint
zh_hans: 回车运行 · Shift+回车换行 · Esc 取消

source: agent.intent-prompt-title
zh_hans: 希望我做什么？

source: agent.key-not-stored
zh_hans: 尚未存储 Key

source: agent.key-stored
zh_hans: 已存储 Token

source: agent.max-actions-title
zh_hans: 最大动作数

source: agent.mode-description
zh_hans: 理解意图，并在本地安全检查下操作 Mac

source: agent.mode-disabled-status
zh_hans: Agent Mode 已关闭

source: agent.mode-enabled-status
zh_hans: Agent Mode 已开启

source: agent.mode-title
zh_hans: Agent Mode

source: agent.model-title
zh_hans: 模型

source: agent.open-permissions
zh_hans: 打开权限设置

source: agent.paused-by-user
zh_hans: 检测到你使用鼠标或键盘，Agent 已暂停

source: agent.permission-description
zh_hans: 屏幕录制用于观察桌面，辅助功能用于执行语义动作

source: agent.permission-title
zh_hans: 电脑控制权限

source: agent.provider-section
zh_hans: LLM 供应商

source: agent.question-title
zh_hans: Agent 需要你的输入

source: agent.resume-agent
zh_hans: 继续 Agent

source: agent.retain-screenshots-description
zh_hans: 默认关闭。Agent 截图永不进入截图历史

source: agent.retain-screenshots-title
zh_hans: 保留会话截图

source: agent.run-action
zh_hans: 运行

source: agent.save-key
zh_hans: 保存

source: agent.shortcut-description
zh_hans: 仅在 Agent Mode 开启时注册

source: agent.shortcut-title
zh_hans: Agent 意图快捷键

source: agent.start-task
zh_hans: 开始 Agent 任务

source: agent.settings-section
zh_hans: Agent 设置

source: agent.status.awaiting-approval
zh_hans: 等待批准…

source: agent.status.awaiting-user
zh_hans: 等待你的回答…

source: agent.stop-agent
zh_hans: 立即停止 Agent

source: agent.unavailable-permission
zh_hans: Agent Mode 需要屏幕录制和辅助功能权限
